Revit 2027 API
BuiltInFailures.SiteImportFailures.BoundaryDetectError Property
 A boundary on this surface could not be autodetected. Revit will impose one, but it may be larger than you want.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BoundaryDetectError { get; }
Public Shared ReadOnly Property BoundaryDetectError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BoundaryDetectError {
	FailureDefinitionId^ get ();
}
static member BoundaryDetectError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SiteImportFailures Class
Autodesk.Revit.DB Namespace